"""
============================
Author:柠檬班-木森
Time:2020/2/18   21:48
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
函数定义的语法：

def 函数名():
	# 函数内部功能代码一
    # 函数内部功能代码二
    # 函数内部功能代码三
    # 函数内部功能代码四

函数名命名规范：可以由数字、字母、下划线组成，不能使用数字开头，不能使用python的关键字

# 注意点：不要和内置函数同名，不要和模块（第三方模块，官方库）同名（建议）

函数名命名风格：推荐使用下划线命名法



函数的调用：

    函数名（）

"""
print("------------1--")

def print_info():
    print("我叫XXXX")
    print("今年在柠檬班学python自动化")

print("------------2--")
# 调用函数
print_info()

# print_info()
#
# print_info()