"""
============================
Author:柠檬班-木森
Time:2020/2/6   20:21
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
python中的 运算符

1、算术运算符：+、 -、 *、 /、 //、 %、 **
# 整数和整数进行除法运算（/）的时候,得到的结果是浮点数

2、比较预算符：< 、 > 、 <=、  >=、 ==、  !=

3、赋值运算符：= 、+=、-=、/= 、 *=

4、逻辑运算符：and（与）、or（或）、not（非）


5、身份运算符（后面学）

6、成员运算符（后面学）

# 按编码规范格式化代码：Ctrl+Alt+L（快捷键）


"""

# 一、 算术运算符
# a = 100
# b = 5
# # 加
# print(a + b)
# # 减
# print(a - b)
# # 乘
# print(a * b)
# # 除
# print(a / b)

# //:除法 取整(向下)
# print(9 / 5)
# print(9 // 5)

# %：除法 取余数
# print(9 % 5)
# ** ：幂运算
# print(10**3)


#  二、比较运算符：成立返回True  不成立返回False
# aa = 100
# b = 89
# 比较两个值是否相等：==
# print(aa == b)
# print(88 == 88)

# 比较大小
# print(88 > 87)
# print(88 < 87)
# print(89 >= 89)
# print(89 <= 89)

# 比较两个值不相等： ！=
# print(99 != 99)


#  三、赋值运算符
# = :将右边的值赋值给左边的变量
# a = 99

# +=：
# a = a + 1
# a += 1  # 作用等同于：a = a + 1

# -=:
# a = a - 5
# a -= 5  # 作用等同于： a = a - 5

# *=：
# a = a * 1
# a *= 2  # 作用等同于：a = a * 2
# /=：
# a = a / 3
# a /= 3  # 作用等同于：a = a / 3
# print(a)


# 逻辑运算符

# 如何同时去比较两个条件
a = 11
b = 10
c = 12

# and：所有的条件都成立，返回True,否则返回False
# 需求：请比较a是否大于b和c
# print(a > c and a > b)

# or：只要有一个条件成立，就返回True,条件都不成立返回False
# 需求：请比较a大于b或c其中一个
# print(a > c or a > b)

# not：取反(原来是True，则变成False,原来是False,则变成True)
print(not a > b)

# or：一真为真，假假为假
# and:一假为假，真真为真
# not：取反


# num = (111 * 44) - (99 + 99) / (888 ** 99) % (99 - 999)

# print((99 - 88) > 77 and (88 * 77 - 99) < 100)
print((88 > 87 and 88 < 90) or (88 > 100 or 88 > 90))
# 通过（）来控制优先级

# 随机数模块：
