"""
python中的额字符串类型的数据

字符串：str类型

1、字符串如何表示？
    单引号、双引号、三引号 包起来
    单引号和双引号没有任何区别，都是表示一行字符串
    三引号（三个单引号和双引号是一样的）可以用来表示多行字符串

2、如何去打印一个百分数?
    使用字符串来表示:'80%'

3、数值类型的数据可不可以转换为字符串？
    str来进行转换


4、空字符串：只有引号，引号中没有任何内容（连空格键都不能有）

"""

# s = "python语言很6"
# s2 = 'python很简单'
# s3 = '''
# py27期大佬666
# 待遇非常好
# 工作很轻松
# '''
# s4 = """
# py27期大佬666
# 待遇非常好
# 工作很轻松
# """
# print(type(s))
# print(type(s2))
# print(type(s3))
# print(type(s4))
# print(s3)
# print(s4)

#  需求： 字符中有一个单引号，怎么表示这个字符串：789'qrtyuio
# ss = "789'qrtyuio"
# ss2 = '789"00000'
# ss3 = '''1222'333"333'''

# n = '80%'
# print(n)

# print(type("777"))
