"""
============================
Author:柠檬班-木森
Time:2020/2/6   21:52
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

#  数值类型的数据和字符串直接进行转换
# n = 100
# print(type(n))
# 整数转换为字符串
# n1 = str(n)
# print(n1, type(n1))

# 浮点数转换为字符串
# f = str(0.8888)
# print(f, type(f))

# 布尔值转换为字符串
# t = str(True)
# print(t, type(t))

# 2、整数、浮点数、布尔值直接可不可以进行相互转换（可以的）
a = 11
b = 11.99
c = True
# 浮点数转换为整数
# print(int(b))
# 布尔值转换为整数：True的整数值为1，False的整数值为0
# print(int(False))


# 整数和布尔值转换为浮点数
# print(float(11))
# print(float(False))


# 整数和浮点数转换为布尔值：（只要不是0,布尔值都为True）
# print(bool(11))
# print(bool(-1.011))
# print(bool(0))


# 3、字符串可不可以转换为数值类型？
# 01、字符串转换为整数（前提是字符串中都是数字，不能有字母，符号）
# print(int("789"))

# 02、字符转换浮点数（前提是字符串中都是数字，不能有字母，符号）
# print(float("67.89"))

# 03、字符串转换为布尔值（都可以转）
# 空字符串的bool值为False,其他的都是为True
# print(bool(""))
# print(bool("?"))




# python中的任何数据都可以转换为布尔值
# 数值中0的值为False
# 字符串中空字符为Flase



"""
下节课内容：
# 字符串
1、字符串转义
2、字符串格式化输出
3、字符串常用方法
# 列表：



"""
