"""
============================
Author:柠檬班-木森
Time:2020/2/29   10:05
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
这一类事物拥有的共同特征，我们通常会定义为类属性

类属性：在类里面直接定义的变量，叫做类属性
# 通过对象访问类属性：对象名.属性名 
# 通过类访问类属性：类名.属性名


实例属性：每个对象的属性值都有可能不一样，就应该定义为实例属性（对象属性）
实例属性的定义：对象.属性名 = 属性值







"""

# print("------------------类属性--------------------")
# class Cat:
#     leg = "四条腿"
#     tail = "长尾巴"
#
#
# kitty = Cat()
# coffee = Cat()
#
# # 通过对象访问类属性：对象名.属性名
# print(kitty.leg)
# print(coffee.leg)
# # 通过类访问类属性：类名.属性名
# print(Cat.leg)


print("------------------实例属性--------------------")


class Cat:
    leg = "四条腿"
    tail = "长尾巴"


kitty = Cat()
coffee = Cat()
# 给对象添加属性
kitty.name = "凯蒂猫"
kitty.age = 2
kitty.gender = "母"

coffee.name = "加菲猫"
coffee.age = 1
coffee.gender = "公"

# 通过对象访问对象属性：对象名.属性名
print(kitty.name)
print(coffee.name)

# 通过类访问类属性：类名.属性名
# print(Cat.leg)


# 定义一个学生类，有身份，名字，年龄，班级四个属性：

# 定义一个人类：性别，民族，休息方式