"""
============================
Author:柠檬班-木森
Time:2020/2/11   20:14
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

"""
序列类型的数据：数据内部的元素是有顺序的（有下标）

序列类型的数据：字符串类型、列表类型、元组类型

序列类型数据的共同特性：
1、可以通过下标取值
[下标]

2、可以进行切片操作
用法一：[起始位置:终止位置]:左闭右开

用法二：[起始位置:终止位置:步长]

"""

# li = [11, 22, 33, 44, 55, 66, 77, 88]

# 切片使用步长
# res = li[::2]  # [11, 33, 55, 77]
# res = li[::3]  # [11, 44, 77]
# res = li[::4]    # [11, 55]
# print(res)

# 使用反向的下标进行切片
# res1 = li[2:5]
# res1 = li[-6:-3]
# res1 = li[2:-3]
# print(res1)

# 步长默认为1,

# 步长设置为负数（扩展：了解节可）
# li = [11, 22, 33, 44, 55, 66, 77, 88]
# # 需求：通过切片获取 [55, 44, 33]
# print(li[-4:-7:-1])
# print(li[4:1:-1])
#
# # 需求：通过切片获取 [77，33]
# print(li[-2:-7:-4])












