"""
============================
Author:柠檬班-木森
Time:2020/2/15   10:10
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

"""
#### 1、按数据结构分类：

- ##### 一、数值类型 : 整数   浮点数    布尔值

- ##### 二、序列类型：字符串、列表  元祖（可以通过下标取值，支持切片操作）

- ##### 三、散列类型：字典、集合（元素内部是无序的，没有下标）




#### 2、数据类型的可变不可变：

- ##### 不可变类型：数值类型、字符串、元组

    - ###### 字符串和元组定义之后不能修改内部的结构或者值（内存单元中的值），为不可变类型

- ##### 可变类型：列表、字典、集合

- 如何区分可变不可变数据：定义一个集合，把数据放到集合中看会不会报错。



### 3、数据的嵌套


"""

# n = 'python'
# res = n.replace("p","ttt")
# print(res)
#
# print(n)

# tu = (1, 11, 22)


# 列表里嵌套列表
# li = [[1, 2, 3], [1, 2, 3, [1, 'python', '333']]]
#
# res = li[1][3][1]
# print(res)


# 列表嵌套字典
# li2 = [{"name": "小明", "info": [1, 2, 3, 4]}, {"name": "无名"}, {"name": "欧阳"}]
