"""
============================
Author:柠檬班-木森
Time:2020/2/20   21:09
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

"""
函数定义
*: 表示接收位置参数的不定长参数
**:表示接收关键字参数的不定长参数


"""


# 函数定义
# *: 表示接收位置参数的不定长参数
# **:表示接收关键字参数的不定长参数
# def func(*a, **b):
#     print(a)
#     print(b)
#
# func(11, 22, 33, aa=11, bb=22, c=33)

# 函数调用
# *：函数调用的时候可以用来对元组或列表拆包
# **:函数调用的时候可以用来对字典拆包
def func(a, b, c, d):
    print(a)
    print(b)
    print(c)
    print(d)


# func(11,22,33,44)
# tu = (111, 222, 334, 444)
# # func(tu[0], tu[1], tu[2], tu[3])
# func(*tu)
# **：对字典拆包
# dic = {"a": 1, "b": 2, "c": 3, "d": 4}
# func(**dic)

# dic = {"a": 1, "b": 2, "c": 3, "d": 4}


